000001* CSCI3180 Principles of Programming Languages
000002*
000003* --- Declaration ---
000004*
000005* I declare that the assignment here submitted is original except for source
000006* material explicitly acknowledged. I also acknowledge that I am aware of
000007* University policy and regulations on honesty in academic work, and of the
000008* disciplinary guidelines and procedures applicable to breaches of such policy
000009* and regulations, as contained in the website
000010* http://www.cuhk.edu.hk/policy/academichonesty/
000011*
000012* Assignment N
000013* Name : Chung Tsz Ting
000014* Student ID : 1155110208
000015* Email Addr : ttchung8@cse.cuhk.edu.hk
000016
000020 IDENTIFICATION DIVISION.
000021 PROGRAM-ID. ASG1.
000022  
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060     SELECT OPTIONAL INSTRUCTORS-FILE ASSIGN TO 'instructors.txt'
000080         ORGANIZATION IS LINE SEQUENTIAL
002000         FILE STATUS IS INSTRUCTORS-FILE-STATUS.
000090 
000100     SELECT OPTIONAL CANDIDATES-FILE ASSIGN TO 'candidates.txt'
000110        ORGANIZATION IS LINE SEQUENTIAL
000120         FILE STATUS IS CANDIDATES-FILE-STATUS.
000130  
000140     SELECT OPTIONAL OUTPUT-FILE ASSIGN TO 'output.txt'
000150        ORGANIZATION IS BINARY SEQUENTIAL.
000160 
000300 DATA DIVISION.
000400 FILE SECTION.
000410 FD INSTRUCTORS-FILE.
000420 01 INSTRUCTORS.
000430     03 COURSE PIC 9(5).
000440     03 COMPLU PIC X(15) OCCURS 3 TIMES.
000450     03 OPTION PIC X(15) OCCURS 5 TIMES.
000460
000470 FD CANDIDATES-FILE.
000480 01 CONDIDATES.
000490     03 TA PIC X(11).
000500     03 SKILLS PIC X(15) OCCURS 8 TIMES.
000510     03 PREF PIC 9(5) OCCURS 3 TIMES.
000520     
000530 FD OUTPUT-FILE.
000540 01 RESULT.
000550     03 COURSE-O PIC 9(5).
000560     03 TA-O PIC X(11) OCCURS 3 TIMES.
000570     03 EOF PIC X.
000580
000600 WORKING-STORAGE SECTION.
000610 01 CANDIDATES-FILE-STATUS PIC X(2).
000620 01 INSTRUCTORS-FILE-STATUS PIC X(2).
000630 01 I-COUNT PIC 9(2) VALUE 0.
000640 01 J-COUNT PIC 9(2) VALUE 0.
000650 01 PLACE PIC 9 VALUE 0.
000650 01 ERROR-DISPLAY PIC 9 VALUE 0.
000660 01 TMP PIC 9V9 VALUE 0.
000670 01 SCORE PIC 9V9 VALUE 0.
000680 01 TMP-NAME PIC X(11) VALUE '0000000000 '.
000690 01 TMP-NAME2 PIC X(11) VALUE '0000000000 '.
000700 01 TMP-SCORE2 PIC 9V9 VALUE 0.
000710 01 TMP-SCORE PIC 9V9 VALUE 0.
000720 01 TOP3.
000730     03 TOP3-N PIC X(11) VALUE '0000000000 ' OCCURS 3 TIMES.
000740     03 TOP3-S PIC 9 VALUE 0 OCCURS 3 TIMES.
000760 
001000 PROCEDURE DIVISION.
001010 MAIN-PARAGRAPH.
001011     OPEN INPUT INSTRUCTORS-FILE.
001012     IF INSTRUCTORS-FILE-STATUS NOT = 00 THEN
001013         DISPLAY "non-existing file!"
001014         CLOSE INSTRUCTORS-FILE
001015         STOP RUN
001016     END-IF.
001017     OPEN INPUT CANDIDATES-FILE.
001018     IF (CANDIDATES-FILE-STATUS NOT = 00 AND 
001019         CANDIDATES-FILE-STATUS NOT = 41) THEN
001020         DISPLAY "non-existing file!"
001021         CLOSE INSTRUCTORS-FILE
001022         CLOSE CANDIDATES-FILE
001023         STOP RUN
001024     END-IF.
001025     OPEN OUTPUT OUTPUT-FILE.
001030
001050 INSTRUCTORS-READ.
001060     READ INSTRUCTORS-FILE 
001070     AT END
001080*         DISPLAY "End of i-File"
001090         GO TO END-PARAGRAPH
001100     END-READ.
001110 
001120 INITIALIZING.
001130     MOVE '0000000000' TO TOP3-N(1).
001140     MOVE '0000000000' TO TOP3-N(2).
001150     MOVE '0000000000' TO TOP3-N(3).
001160     MOVE 0 TO TOP3-S(1).
001170     MOVE 0 TO TOP3-S(2).
001180     MOVE 0 TO TOP3-S(3).
001190 
001200 CANDIDATES-READ.
001210*     OPEN INPUT CANDIDATES-FILE.
001220     READ CANDIDATES-FILE
001230     AT END
001240*         DISPLAY "End of c-File"
001250         CLOSE CANDIDATES-FILE
001210         OPEN INPUT CANDIDATES-FILE
001260         GO TO FILE-O
001270     END-READ.
001280     MOVE 0 TO SCORE.
001290     MOVE 1 TO I-COUNT.
001300     GO TO COMPUTATION-COMPLU-1.
001310 
001320 FILE-O.
001330*     DISPLAY COURSE TOP3-N(1) TOP3-N(2) TOP3-N(3)
001340     MOVE COURSE TO COURSE-O.
001350     MOVE TOP3-N(1) TO TA-O(1).
001360     MOVE TOP3-N(2) TO TA-O(2).
001370     MOVE TOP3-N(3) TO TA-O(3).
001380     MOVE x'0a' TO EOF.
001390     WRITE RESULT.
001400     GO TO INSTRUCTORS-READ.
001410
001420 
001430 COMPUTATION-COMPLU-1.
001440*    Compare whether the 3 complusory are satisfied; if one fail, early break;
001450     IF I-COUNT = 4 OR I-COUNT NOT = SCORE + 1 THEN
001460*        Process to next calculation
001470         IF SCORE = 3 THEN
001480             MOVE 1 TO SCORE
001490             MOVE 1 TO I-COUNT
001500             GO TO COMPUTATION-OPT-1
001510         END-IF
001520         
001530         GO TO CANDIDATES-READ
001540     END-IF.
001570
001580*    nested loop
001590     MOVE 1 TO J-COUNT.
001700     COMPUTATION-COMPLU-2.
001710*        break as finish comparing
001720         IF J-COUNT = 9 THEN
001730*             DISPLAY '2 -- COM END. course: 'COURSE' ,TA: 'TA
001740             ADD 1 TO I-COUNT
001750             GO TO COMPUTATION-COMPLU-1
001760         END-IF.
001770*        compare and increment in score
001780         IF SKILLS(J-COUNT) = COMPLU(I-COUNT) THEN
001790*             DISPLAY 'TA: 'TA' success 'SKILLS(J-COUNT)' ' COURSE
001800             ADD 1 TO SCORE
001810             ADD 1 TO I-COUNT
001820             GO TO COMPUTATION-COMPLU-1
001830         END-IF.
001840         ADD 1 TO J-COUNT.
001850         GO TO COMPUTATION-COMPLU-2.
001860 
001870 
001880 
002000 COMPUTATION-OPT-1.
002010*    finish calc optional skills and go calc pref score
002020     IF I-COUNT = 6 THEN
002030*         DISPLAY 'opt and pre~ COM END.' TA': 'SCORE
002040         MOVE 3 TO I-COUNT
002050         MOVE 1 TO J-COUNT
002060         GO TO COMPUTATION-PREF-1
002070     END-IF.
002080
002090*    nested loop
002100     MOVE 1 TO J-COUNT.
002110     COMPUTATION-OPT-2.
002120*        break as finish comparing
002130         IF J-COUNT = 9 THEN
002140*             DISPLAY I-COUNT' --end. course: 'COURSE' ,TA: 'TA
002150             ADD 1 TO I-COUNT
002160             GO TO COMPUTATION-OPT-1
002170         END-IF.
002180*        compare and increment in score
002190         IF SKILLS(J-COUNT) = OPTION(I-COUNT) THEN
002200*             DISPLAY 'TA: 'TA' success 'SKILLS(I-COUNT)' ' COURSE
002210             ADD 1 TO SCORE
002220             ADD 1 TO I-COUNT
002230             GO TO COMPUTATION-OPT-1
002240         END-IF.
002250         ADD 1 TO J-COUNT.
002260         GO TO COMPUTATION-OPT-2.
002270 
002280 
002390 
002510 COMPUTATION-PREF-1.
002520     IF I-COUNT = 0 THEN
002530         MOVE 1 TO I-COUNT
002540         MOVE 0 TO PLACE
002550         GO TO CALC_TOP3
002560     END-IF.
002570*    compare and increment in score
002580     IF COURSE = PREF(J-COUNT) THEN
002590         MULTIPLY 0.5 BY I-COUNT GIVING TMP
002610         ADD TMP TO SCORE
002620         MOVE 1 TO I-COUNT
002630         MOVE 0 TO PLACE
002640         GO TO CALC_TOP3
002650     END-IF.
002660     SUBTRACT 1 FROM I-COUNT.
002670     ADD 1 TO J-COUNT.
002680     GO TO COMPUTATION-PREF-1.
002690 
002700 
002900 CALC_TOP3.
002910*    break after running from top 3 
002920     IF I-COUNT = 4 THEN
002930         GO TO CANDIDATES-READ
002940     END-IF.
002950*    after replacement is done, move next to next.next
002960     IF PLACE = 1 THEN
002970         MOVE TOP3-N(I-COUNT) TO TMP-NAME2 
002980         MOVE TOP3-S(I-COUNT) TO TMP-SCORE2
002990         MOVE TMP-NAME TO TOP3-N(I-COUNT) 
003010         MOVE TMP-SCORE TO TOP3-S(I-COUNT) 
003020         MOVE TMP-NAME2 TO TMP-NAME 
003030         MOVE TMP-SCORE2 TO TMP-SCORE 
003040     END-IF.
003050*    see whether need to replace to the existing TA
003060     IF SCORE > TOP3-S(I-COUNT) AND PLACE NOT = 1 THEN
003070*        remember the original (move to next later)   
003080         MOVE TOP3-N(I-COUNT) TO TMP-NAME
003090         MOVE TOP3-S(I-COUNT) TO TMP-SCORE
003100         MOVE TA TO TOP3-N(I-COUNT) 
003110         MOVE SCORE TO TOP3-S(I-COUNT)
003120         MOVE 1 TO PLACE
003130     END-IF.
003140     ADD 1 TO I-COUNT.
003150     GO TO CALC_TOP3.
003160 
003170 
003180 END-PARAGRAPH.
003190     CLOSE INSTRUCTORS-FILE.
001210     CLOSE CANDIDATES-FILE.
003200     CLOSE OUTPUT-FILE.
003210     STOP RUN.
